{
  "books": [
    {
      "Name": "Close to the Machine",
      "Author": "Ellen Ullman",
      "Desc": "Close to the Machine is a book about the history and culture of Unix programming from its earliest days in 1969 to 2003 when it was published, covering both genetic derivations such as BSD and conceptual ones such as Linux.",
        "Pages": "150",
        "Image": "close.jpg"
    },
    {
      "Name": "The Art of Unix Programming",
      "Author": "Eric Raymond",
      "Desc": "The Art of Unix Programming by Eric S. Raymond is a book about the history and culture of Unix programming from its earliest days in 1969 to 2003 when it was published, covering both genetic derivations such as BSD and conceptual ones such as Linux.",
        "Pages": "250",
        "Image": "unix.jpg"
    },
    {
      "Name": "The Art of Computer Programming",
      "Author": "Donald Knuth",
      "Desc": "The Art of Computer Programming (sometimes known by its initials TAOCP) is a comprehensive monograph written by Donald Knuth that covers many kinds of programming algorithms and their analysis.",
        "Pages": "350",
        "Image": "program.jpg"
    },
    {
      "Name": "Free Software, Free Society",
      "Author": "Richard M. Stallman",
      "Desc": "Free Software, Free Society: Selected Essays of Richard M. Stallman is a book that collects the writing of Richard M. Stallman. The first edition was published in 2002 by GNU Press under the GNU Free Documentation License. ",
        "Pages": "170",
        "Image": "free.jpg"
    },
    {
      "Name": "Patterns of Software",
      "Author": "Richard P. Gabriel",
      "Desc": "Patterns of Software is a book that collects the writing of Richard M. Stallman. The first edition was published in 2002 by GNU Press under the GNU Free Documentation License. ",
        "Pages": "650",
        "Image": "pattern.jpg"
    },
    {
      "Name": "Innovation Happens Elsewhere",
      "Author": "Richard P. Gabriel",
      "Desc": "Innovation Happens Elsewhere is a book by Keith Curtis about free software and its importance in the computing industry, specifically about its impact on Microsoft and the proprietary software development model.",
        "Pages": "380",
        "Image": "innovation.jpg"
    },
    {
      "Name": "After the Software Wars",
      "Author": "Keith Curtis",
      "Desc": "After the Software Wars is a book by Keith Curtis about free software and its importance in the computing industry, specifically about its impact on Microsoft and the proprietary software development model.",
        "Pages": "420",
        "Image": "wars.jpg"
    },
    {
      "Name": "The Psychology of Computer Programming",
      "Author": "Gerald M. Weinberg",
      "Desc": "Wikipedia does not have an article with this exact name. Please search for The Psychology of Computer Programming in Wikipedia to check for alternative titles or spellings.",
        "Pages": "110",
        "Image": "psychology.jpg"
    },
    {
      "Name": "The Practice of Programming",
      "Author": "Brian W. Kernighan",
      "Desc": "The Practice of Programming (ISBN 0-201-61586-X) by Brian W. Kernighan and Rob Pike is a 1999 book about computer programming and software engineering, published by Addison-Wesley.",
        "Pages": "390",
        "Image": "practice.jpg"
    },
    {
      "Name": "The Best Software Writing I",
      "Author": "Joel Spolsky",
      "Desc": "The Best Software Writing I is a 1999 book about computer programming and software engineering, published by Addison-Wesley.",
        "Pages": "140",
        "Image": "writing.jpg"
    }
  ]
}